architecture: two_layer
nb_filters_1: 64
filter_size_1: 7
stride_1: (3, 3)
pool_size_1: (3, 3)
nb_filters_2: 128
filter_size_2: 4
stride_2: (1, 1)
learning_rate: 0.005
momentum: 0.9
decay: 0.002
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
convolution2d_1 (Convolution2D)  (None, 20, 20, 64)    9472        convolution2d_input_1[0][0]      
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 20, 20, 64)    0           convolution2d_1[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 6, 6, 64)      0           activation_1[0][0]               
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 3, 3, 128)     131200      maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 3, 3, 128)     0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 1152)          0           activation_2[0][0]               
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 4096)          4722688     flatten_1[0][0]                  
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 4096)          0           dense_1[0][0]                    
====================================================================================================
Total params: 4,863,360
Trainable params: 4,863,360
Non-trainable params: 0
____________________________________________________________________________________________________
